Repository: manjeetsaggi/drupal-6-modules
Catalog: syntaxhighlighter/translations/syntaxhighlighter-module.*.po
Languages: de

source: Syntax highlighter enabled languages
de: Aktivierte Sprachen des Syntax Highlighter

source: Only the selected languages will be enabled and its corresponding required Javascript files loaded. You may only want to choose the languages you actual display on your site to lower the amount of Javascript files loaded. For details please see <a href="http://alexgorbatchev.com/wiki/SyntaxHighlighter:Brushes">the Syntax Highlighter Javascript Library Page</a>.
de: Es werden nur die ausgewählten Sprachen aktiviert und entsprechende Javascript Dateien geladen. Sie sollten nur die Sprachen auswählen, die Sie aktuell auf Ihrer Seite darstellen um die Anzahl der zu ladenden Javascript Dateien zu verringern. Details entnehmen Sie bitte <a href="http://alexgorbatchev.com/wiki/SyntaxHighlighter:Brushes">der Syntax Highlighter Javascript Bibliothek Seite</a>.

source: Choose a syntax highlight theme.
de: Ein Syntax Highlighter Theme auswählen.

source: Use different tag to markup code.
de: Den Code markierender Tag.

source: Legacy mode
de: Kompatibilitätsmodus

source: Enable pre-2.0 style markup support.
de: Aktiviere Unterstützung für Markierung der pre-2.0 Version.

source: Disabled
de: Deaktiviert

source: Enabled
de: Aktiviert

source: + expand source
de: + Quelltext ausklappen

source: view source
de: Quelltext anzeigen

source: copy to clipboard
de: in die Zwischenablage kopieren

source: The code is in your clipboard now
de: Der Code ist jetzt in Ihrer Zwischenablage

source: print
de: drucken

source: Can't find brush for:
de: Kann keinen Brush finden für:

source: Brush wasn't made for html-script option:
de: Brush wurde nicht gemacht für die HTML-Skript Option:

source: Configure syntax highlighter
de: Konfiguriere syntax highlighter

source: Syntax highlighter module
de: Syntax highligther Modul

source: The required Syntax Highlighter Javascript library has not been installed. Please see README.txt.
de: Die benötigte Syntax Hightlighter Javascript Bibliothek wurde nicht installiert. Siehe README.txt.

source: Integrates the Syntax Highlighter Javascript Library to your site.
de: Integriert die Syntax Highlighter Javascript-Bibliothek auf Ihrer Website.
