Repository: manjeetsaggi/drupal-6-modules
Catalog: xmlsitemap/translations/*.po
Languages: fr

source: Configure the site map.
fr: Configurer le plan du site.

source: Configure the behavior for search engines.
fr: Configurer le comportement pour les moteurs de recherche.

source: XML Sitemap automatically creates a site map that conforms to the <a href="@sitemaps.org">sitemaps.org specification</a>. This helps search engines keep their search results up to date.
fr: XML Sitemap créée automatiquement un plan du site conforme aux <a href="@sitemaps.org">spécifications sitemaps.org</a>. Ceci aide les moteurs de recherche à garder leurs résultats de recherche à jour.

source: Supporting modules
fr: Supporte les modules

source: By itself, the XML Sitemap module adds only the front page of your site to the site map. Other types of links are handled by supporting modules.
fr: En soi, le module XML Sitemap n'ajoute que la page d'accueil de votre site au plan du site. Les autres types de liens sont gérés par les modules de support.

source: Links may be assigned a priority between 0.0 and 1.0. The default priority is 0.5. A priority of <em>Not in site map</em> excludes a link from the site map.
fr: On peut assigner une priorité comprise entre 0.0 et 1.0 aux liens. La priorité par défaut est 0.5. Une priorité de <em>Pas dans le plan du site</em> exclue un lien du plan du site.

source: More information is available in the <a href="@module_docs">XML Sitemap documentation</a>.
fr: Plus d'information disponible sur la <a href="@module_docs">documentation XML Sitemap</a>.

source: Submission settings
fr: Paramètres de soumission

source: Submit the site map when updated
fr: Soumettre le plan du site lors de sa modification

source: If enabled, the search engines will be notified of changes to the site map each time it is updated.
fr: Si activé, les moteurs de recherche seront prévenus des changements du plan du site à chacune de ses mises à jour.

source: Log access
fr: Loguer les accès

source: If enabled, a watchdog entry will be made each time the site map is accessed, containing information about the requestor.
fr: Si activé, des informations sur l'émeteur de la requête seront ajoutées au journal chaque fois que le plan du site est consulté.

source: Frequency of cron site map submission
fr: Fréquence de la soumission du plan du site lors du cron

source: The rate at which the site map is submitted to the search engines over the times the cron maintenance tasks are executed.
fr: La fréquence à laquelle le plan du site est soumis aux moteurs de recherche, lors des fois où la tâche cron de maintenance est exécutée.

source: Once every ten times
fr: Une fois sur dix

source: Once every nine times
fr: Une fois sur neuf

source: Once every eight times
fr: Une fois sur huit

source: Once every seven times
fr: Une fois sur sept

source: Once every six times
fr: Une fois sur six

source: Once every five times
fr: Une fois sur cinq

source: Once every four times
fr: Une fois sur quatre

source: Once every three times
fr: Une fois sur trois

source: Once every two times
fr: Une fois sur deux

source: Always
fr: Toujours

source: Never
fr: Jamais

source: General settings
fr: Paramètres généraux

source: Chunk size
fr: Taille du morceau

source: This is the number of links to include in one site map. Values can range between 1 and 50,000. If the total number of links exceeds the chunk size, multiple site maps will be generated.
fr: C'est le nombre de liens à inclure dans un plan de site. La valeur doit être comprise entre 1 et 50 000. Si le nombre total de liens dépasse la taille du morceau, plusieurs plans de site seront générés.

source: Add all the links to the default language site map
fr: Ajouter tous les liens au plan du site de la langue par défaut

source: This option will be used only when the language negotiation uses a path prefix mechanism.
fr: Cette option sera utilisée seulement lorsque la gestion de la langue utilise un mécanisme de préfiwage du chemin.

source: Front page change frequency
fr: Fréquence de modification de la page d'accueil

source: The change frequency associated with the front page.
fr: La fréquence de modification associée à la page d'accueil.

source: Cache directory
fr: Répertoire du cache

source: The directory where the cache files are created; change it only if you are having problems with the default setting.
fr: Le répertoire dans lequel les fichiers de cache sont créés; modifiez-le seulement si vous rencontrez des problèmes avec le paramètre par défaut.

source: Priority
fr: Priorité

source: Front page priority
fr: Priorité de la page d'acceuil

source: The absolute priority for the front page.
fr: La priorité absolue pour la page d'accueil.

source: The number of links in a site map chunk must be a number between 1, and 50,000 (1 and 50,000 included).
fr: Le nombre de liens d'un morceau de plan du site doit être un nombre compris entre 1 et 50 000 (1 et 50 000 inclus).

source: Sitemap downloaded by @user-agent at @address.
fr: Plan du site télécharge par @user-agent depuis @address.

source: Could not create the cache files directory (@directory)
fr: Le serveur n'a pas pu créer le répertoire des fichiers de cache (@directory)

source: Cannot create the cache file (@file)
fr: Le serveur n'a pas pu créer le fichier de cache (@file)

source: by-pass the authored nodes check
fr: outrepasser la vérification des noeuds par auteur

source: override node settings
fr: remplacer les paramètres de noeud

source: override profile settings
fr: remplacer les paramètres de profil

source: Configure the XML site map.
fr: Configurer le plan du site XML.

source: Site map
fr: Plan du site

source: Search engines
fr: Moteurs de recherche

source: Configure the submission settings of the XML site map to the search engines.
fr: Configurer les paramètres de soumission d'un plan du site XML aux moteurs de recherche.

source: Disable modules
fr: Désactiver les modules

source: Enable !module
fr: Activer !module

source: Site map index
fr: Index du plan du site

source: Site map !number
fr: Plan du site !number

source: XML Sitemap revision !revision
fr: Revision !revision du Sitemap XML

source: %module has not been enabled
fr: %module n'a pas été activé

source: %module cannot be enabled. Verify that you correctly copied all the files; until Drupal cannot find %module, <em>XML Sitemap</em> will not work correctly. You can <a href="@url">disable</a> the <em>XML Sitemap</em> modules until you do not resolve the problem.
fr: %module ne peut pas être activé. Vérifiez que vous avez correctement copié tous les fichiers; tant que Drupal ne peut pas trouver %module, <em>XML Sitemap</em> ne fonctionnera pas correctement. Vous pouvez <a href="@url">désactiver</a> les modules <em>XML Sitemap</em> jusqu'à la résolution du problème.

source: The module must be <a href="@url">enabled</a>.
fr: Le module doit être <a href="@url">activé</a>.

source: Creates an XML site map in accordance with sitemaps.org specifications.
fr: Crée un plan du site XML en accord avec les spécifications sitemaps.org.
